{
  "message": "hello i18n !!",
  "my-name": "Jan Hazincak",
  "portfolio": "Portfolio",
  "description": "Description",
  
  "home-page-intro": "Hello, I am web developer enthusiast looking for my first job opportunity.",
  

  "about-me": "About me",
  "about-me-detail":"After 7 years working in the hospitality industry I have decided to change my career and jump into programming world. It started with simple Hello World programs.",

  "contact": "Contact",

  "menu":{
    "home": "Home",
    "skills": "Programming Skills",
    "projects": "Projects",
    "education": "Education"
  },

  "my-projects": "My projects",
  "projects-page-intro": "List of projects created either as school or free-time projects.",
  "more-button":"Find out more",
  "used-technologies": "Used technologies",
  "database": "Database",
  "payment-gateways": "Payment gateways",
  "project-demo": "Project demonstration videos",
  
  "e-commerce-description": "Web application simulating single page e-commerce website with dynamic content manageable from the protected admin section.",

  "phone-cases-shop":{
    "title": "E-commerce website",
    "description": "Full e-commerce solution for phone accessories with its own content management system and integrated payment gateways."
  },
  "phone-cases-shop-videos":{
    "categoryCRUD":"Creating, updating and deleting category",
    "categoryCRUD-detail": "Categories, brands and models can be created, updated and deleted from the admin section. Categories are displayed in the sidebar menu after their creation. ",

    "creating-model":"Creating model and attaching it to its brand",
    "creating-model-detail":"Product model must be created before adding the product.",

    "attaching-brand-and-model": "Attaching brand and model to selected category",
    "attaching-brand-and-model-detail": "Brands and models need to be attached to the category before they are displayed in the shop sidebar menu.",

    "adding-product": "Adding product",
    "adding-product-detail": "Categories, brands and models need to be created and attached to each other before adding the product. While adding the product, the user needs to select its category, brand and model. Product model can be then accessed in the shop sidebar under selected category.",

    "updating-product": "Updating product",

    "placing-order-stripe": "Placing order with Stripe payment gateway",
    "placing-order-paypal": "Placing order with PayPal",

    "managing-policies": "Managing dynamic GDPR, rules of return and trading rules pages",
    "managing-policies-detail": "Content of the return & refund policies, trading terms and GDPR pages are highly customizable with the WYSIWYG (What You See Is What You Get) editor which is wrapping the text in HTML tags.",

    "managing-carousel": "Managing dynamic carousel",
    "protecting-routes": "Protecting routes"
  },

  "weather-app":{
    "title": "Weather and News mobile application",
    "description": "Mobile application created as final project of Mobile Applications Development module at GMIT."
  },

  "laptopmania":{
    "description": "Website created as final project of Web Application Development module at GMIT."
  },

  "sap-concur":{
    "description": "Wordpress website created as school project hosted on an AWS cloud-based LAMP server."
  },

  "blog-system":{
    "description": "Blog website with its own content management system represented by protected admin and user areas."
  },

  "movie-fight":{
    "description": "Javascript application for comparing movies."
  },

  "java":{
    "title": "Java projects",
    "description": "Java projects completed as GMIT's modules final projects."
  }
}