{
  "my-name": "Ján Hažinčák",
  "portfolio": "Portfólio",
  "project-description": "Popis projektu",
  "description": "Popis",
  "database": "Databáza",
  "databases": "Databázy",
  "my-projects": "Moje projekty",
  "projects-page-intro": "Zoznam projektov školských a vlastných projektov.",
  "more-button": "Zobraziť podrobnosti",
  "used-technologies": "Použité technológie",
  "other-used-technologies": "Ostatné použité technológie",
  "payment-gateways": "Platobné brány",
  "project-demo": "Video ukážky projektu",
  "project-features": "Implementované funkcie",
  "source-code": "Zdrojový kód",
  "database-design": "Štruktúra databázy",
  "experience-with": "Skúsenosti s",

  "application-state": "Aplikačný stav",
  
  "dynamic-content": "Dynamický obsah",
  "dynamic-content-detail":"Obsah tohto e-shopu môže byť vytvorený, upravený alebo vymazaný z admin sekcie.",
  "manageable-content": "Spravovateľný obsah:",
  
  
  "admin-section": "Admin sekcia",
  "email-notification": "Email upozornenia",
  "responsiveness": "Responzívny web dizajn",
  "shopping-cart": "Nákupný košík",
  
 
  "home-page-intro": "Ahoj, moje meno je Ján Hažinčák a hľadám si prácu na pozíciách Junior PHP alebo JavaScript developer",

  "about-me": "O mne",

  "contact": "Kontakt",

  "menu":{
    "home": "Domov",
    "skills": "Programovacie znalosti",
    "projects": "Projekty",
    "education": "Vzdelanie"
  },

  

  "e-commerce-description": "Vlastný redakčný systém vo forme internetového obchodu.",
  
  "phone-cases-shop":{
    "title": "Internetový obchod",
    "description": "Webová aplikácia na predaj mobilného príslušenstva s vlastným redakčným systémom, dynamickým obsahom a integrovanymi platobnými bránami.",
    "description-detail": "Táto stránka bola vytvorená ako projekt pre moje portfólio. Účelom tejto webovej stránky si bolo vyskúšať prácu na pokročilejšiom projekte s využitím frameworkov Vuejs a Laravel. Stránka implementuje základne prvky internetového obchodu ako sú platobné brany, počítanie ceny na základe zvoleného spôsobu dopravy a zaplatenia alebo tiež možnosť spravovania obsahu stránky z admin sekcie.",

    "manageable-content-items": {
      "carousel": "Produkty zobrazené v karuseli na domovskej stránke",
      "products-features": "Kategórie, značky, modely, farby a materiály produktov",
      "products": "Vytváranie, aktualizácia a odstraňovanie produktov",
      "other-pages": "Obsah pravidiel vrátenia tovaru, ochrany osobných údajov a obchodných pravdiel"
    },

    "admin-section-detail": "Obsah je spravovateľný z admin sekcie, ku ktorej prístup je chránený jednak na frontende (VueJS Navigation Guards) a na backende (Laravel Gates).",
    "email-notification-detail": "Zakaznik e-shopu je upozornený po úspěšnej objednávke a takisto ak je jeho objednávka potvrdená",
    "responsiveness-detail": "Responzívny dizajn je dosiahnutý najmä Bootsrapom. Všetky ostatné elementy ako napríklad veľkosť textu su dynamicky modifikované Sass mixin funkciou, ktorá reaguje na definované zlomy.",
    "shopping-cart-details": "Produkty pridané do nákupného košíka sú dostupné naprieč všetkými stránkami e-shopu. Rovnako sú uložené v HTML5 webovom uložisku bez expiračnej doby. To zaručuje, že obsah nákupného košíka je dostupný aj po znovu načítání webovej stránky."
  

  }, 

  "phone-cases-shop-videos":{
    "categoryCRUD":"Vytvorenie, úprava a vymazanie kategórie",
    "categoryCRUD-detail": "Kategória, značky a modely produktov môžu byť vytvorené, aktualizované a vymazané z admin sekcie. Kategórie su po pridání zobrazene v obchodnom menu.",

    "creating-model":"Vytvorenie modelu a priradenie ku značke",
    "creating-model-detail":"Model produktu musí byť vytvorený pred pridáním produktu.",

    "attaching-brand-and-model": "Priradenie modelu a značky ku kategórii",
    "attaching-brand-and-model-detail": "Modely a značky musia byť priradené ku kategórii pred pridáním produktu. Priradené modely a značky sú potom hierarchicky usporiadané v obchodnom menu.",

    "adding-product": "Pridávanie produktu",
    "adding-product-detail": "Kategórie, modely a značky musia byť vytvorené a priradené k sebe pred pridáním produktu. Po úspešnom pridání produktu, je tento produkt dostupný pod určenou kategóriou, značkou a modelom v obchodnom menu.",

    "updating-product": "Aktualizácia produktu",

    "placing-order-stripe": "Zaplatenie kartou (STRIPE)",
    "placing-order-paypal": "Zaplatenie cez PayPal",

    "managing-policies": "Správa dynamického obsahu",
    "managing-policies-detail": "Dynamické menenie obsahu vybraných stránok pomocou WYSIWYG editoru, ktorý umožňuje vložiť text spolu s HTML značkami. ",

    "managing-carousel": "Správa produktov zobrazených v karuseli",

    "protecting-routes": "Ochrana admin sekcie"
  },

  "weather-app":{
    "title": "Mobilná aplikácia na počasie",
    "description": "Mobilná aplikácia vypracovaná ako záverečná práca predmetu na GMIT."
  },

  "laptopmania":{
    "description": "Internetová stránka vypracovaná ako záverečná práca predmetu na GMIT."
  },

  "sap-concur":{
    "description": "Wordpress internetová stránka vypracovaná ako záverečná práca predmetu na GMIT. Stránka funguje na Linux, Apache, MySQL, PHP webovom serveri vytvorenom na AWS EC2 inštancii."
  },

  "blog-system":{
    "description": "Internetová stránka vo forme blogu s vlastným redakčným systémom obsahujúca funkcie s oprávneniami správcu a používateľa."
  },

  "movie-fight":{
    "description": "Javascript aplikácia na porovnanie filmov."
  },

  "java":{
    "title": "Java projekty",
    "description": "Java projekty vypracované ako záverečné práce predmetov na GMIT."
  }
}